# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Fri Jul 05 12:01:51 IST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sdrc_xfr_ctl

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.5 [get_ports x2b_ack]
set_load -pin_load 0.5 [get_ports x2b_refresh]
set_load -pin_load 0.5 [get_ports {x2b_pre_ok[3]}]
set_load -pin_load 0.5 [get_ports {x2b_pre_ok[2]}]
set_load -pin_load 0.5 [get_ports {x2b_pre_ok[1]}]
set_load -pin_load 0.5 [get_ports {x2b_pre_ok[0]}]
set_load -pin_load 0.5 [get_ports x2b_act_ok]
set_load -pin_load 0.5 [get_ports x2b_rdok]
set_load -pin_load 0.5 [get_ports x2b_wrok]
set_load -pin_load 0.5 [get_ports sdr_cs_n]
set_load -pin_load 0.5 [get_ports sdr_cke]
set_load -pin_load 0.5 [get_ports sdr_ras_n]
set_load -pin_load 0.5 [get_ports sdr_cas_n]
set_load -pin_load 0.5 [get_ports sdr_we_n]
set_load -pin_load 0.5 [get_ports {sdr_dqm[1]}]
set_load -pin_load 0.5 [get_ports {sdr_dqm[0]}]
set_load -pin_load 0.5 [get_ports {sdr_ba[1]}]
set_load -pin_load 0.5 [get_ports {sdr_ba[0]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[12]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[11]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[10]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[9]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[8]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[7]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[6]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[5]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[4]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[3]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[2]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[1]}]
set_load -pin_load 0.5 [get_ports {sdr_addr[0]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[15]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[14]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[13]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[12]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[11]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[10]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[9]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[8]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[7]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[6]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[5]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[4]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[3]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[2]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[1]}]
set_load -pin_load 0.5 [get_ports {sdr_dout[0]}]
set_load -pin_load 0.5 [get_ports {sdr_den_n[1]}]
set_load -pin_load 0.5 [get_ports {sdr_den_n[0]}]
set_load -pin_load 0.5 [get_ports x2a_rdstart]
set_load -pin_load 0.5 [get_ports x2a_wrstart]
set_load -pin_load 0.5 [get_ports x2a_rdlast]
set_load -pin_load 0.5 [get_ports x2a_wrlast]
set_load -pin_load 0.5 [get_ports {x2a_id[3]}]
set_load -pin_load 0.5 [get_ports {x2a_id[2]}]
set_load -pin_load 0.5 [get_ports {x2a_id[1]}]
set_load -pin_load 0.5 [get_ports {x2a_id[0]}]
set_load -pin_load 0.5 [get_ports x2a_wrnext]
set_load -pin_load 0.5 [get_ports {x2a_rddt[15]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[14]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[13]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[12]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[11]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[10]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[9]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[8]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[7]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[6]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[5]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[4]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[3]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[2]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[1]}]
set_load -pin_load 0.5 [get_ports {x2a_rddt[0]}]
set_load -pin_load 0.5 [get_ports x2a_rdok]
set_load -pin_load 0.5 [get_ports sdr_init_done]
set_load -pin_load 0.5 [get_ports {xfr_bank_sel[1]}]
set_load -pin_load 0.5 [get_ports {xfr_bank_sel[0]}]
set_false_path -from [get_ports reset_n]
set_false_path -to [get_ports reset_n]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports reset_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2x_req]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2x_start]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2x_last]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2x_tras_ok]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2x_wrap]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports r2x_idle]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2x_idle]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_ba[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_ba[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_addr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_len[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_cmd[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {b2x_cmd[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wrdt[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wren_n[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {a2x_wren_n[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_din[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdram_enable]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdram_mode_reg[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {cas_latency[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {cas_latency[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {cas_latency[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trp_delay[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trp_delay[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trp_delay[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trp_delay[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trcar_delay[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trcar_delay[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trcar_delay[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {trcar_delay[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {twr_delay[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {twr_delay[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {twr_delay[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {twr_delay[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_time[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_rmax[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_rmax[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {rfsh_rmax[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2b_ack]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2b_pre_ok[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2b_pre_ok[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2b_pre_ok[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2b_pre_ok[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2b_refresh]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2b_act_ok]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2b_rdok]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2b_wrok]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2a_rdstart]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2a_wrstart]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2a_rdlast]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2a_wrlast]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_id[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_id[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_id[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_id[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {x2a_rddt[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2a_wrnext]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports x2a_rdok]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_init_done]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_cs_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_cke]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_ras_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_cas_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_we_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dqm[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dqm[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_ba[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_ba[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_den_n[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_den_n[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {xfr_bank_sel[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {xfr_bank_sel[0]}]
set_wire_load_mode "enclosed"
