# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Fri Jul 05 11:45:45 IST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sdrc_bs_convert

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports reset_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {sdr_width[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {sdr_width[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports x2a_rdstart]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports x2a_wrstart]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports x2a_rdlast]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports x2a_wrlast]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {x2a_rddt[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports x2a_rdok]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports x2a_wrnext]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_en_n[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_en_n[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_en_n[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_wr_en_n[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports reset_n]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {sdr_width[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {sdr_width[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports x2a_rdstart]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports x2a_wrstart]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports x2a_rdlast]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports x2a_wrlast]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {x2a_rddt[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports x2a_rdok]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports x2a_wrnext]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_en_n[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_en_n[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_en_n[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_wr_en_n[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wrdt[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wren_n[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {a2x_wren_n[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports app_wr_next]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports app_last_wr]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports {app_rd_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports app_rd_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.5 [get_ports app_last_rd]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wrdt[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wren_n[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {a2x_wren_n[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports app_wr_next]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports app_last_wr]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports {app_rd_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports app_rd_valid]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_ports app_last_rd]
set_wire_load_mode "enclosed"
