# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Wed Jul 03 15:07:11 IST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sdrc_core

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
create_clock -name "pad_clk" -period 10.0 -waveform {0.0 5.0} [get_ports pad_clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_req]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_addr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_req_len[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_req_wrap]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_req_wr_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_en_n[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_en_n[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_en_n[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_wr_en_n[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_req_dma_last]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_req]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_addr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_req_len[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_req_wrap]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_req_wr_n]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_en_n[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_en_n[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_en_n[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_wr_en_n[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_req_dma_last]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_req_ack]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_wr_next_req]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_last_wr]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {app_rd_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_rd_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports app_last_rd]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_req_ack]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_wr_next_req]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_last_wr]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {app_rd_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_rd_valid]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports app_last_rd]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {pad_sdr_din[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {pad_sdr_din[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_cs_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_cke]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_ras_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_cas_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports sdr_we_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dqm[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dqm[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_ba[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_ba[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_dout[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_den_n[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_den_n[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports sdr_cs_n]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports sdr_cke]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports sdr_ras_n]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports sdr_cas_n]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports sdr_we_n]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dqm[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dqm[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_ba[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_ba[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_dout[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_den_n[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {sdr_den_n[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports reset_n]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports reset_n]
set_wire_load_mode "enclosed"
