# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Fri Jul 05 11:55:26 IST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sdrc_req_gen

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports reset_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {cfg_colbits[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {cfg_colbits[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports req]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_addr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {req_len[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports req_wrap]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports req_wr_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2r_ack]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports b2r_arb_ok]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_width[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {sdr_width[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports req_ack]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports r2x_idle]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports r2b_req]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports r2b_start]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports r2b_last]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports r2b_write]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports r2b_wrap]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_req_id[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_req_id[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_req_id[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_req_id[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_ba[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_ba[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_raddr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_caddr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {r2b_len[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.2 [get_clocks clk]
set_clock_uncertainty -hold 0.2 [get_clocks clk]
