# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Wed Jul 03 14:27:15 IST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design wb2sdrc

create_clock -name "wb_clk" -period 20.0 -waveform {0.0 10.0} [get_ports wb_clk_i]
create_clock -name "sdram_clk" -period 20.0 -waveform {0.0 10.0} [get_ports sdram_clk]
set_false_path -from [get_clocks wb_clk] -to [get_clocks sdram_clk]
set_false_path -from [get_clocks sdram_clk] -to [get_clocks wb_clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[25]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[24]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[23]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[22]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[21]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[20]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[19]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[18]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[17]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[16]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[15]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[14]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[13]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[12]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[11]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[10]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[9]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[8]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[7]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[6]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[5]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[4]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[3]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[2]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[1]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_addr_i[0]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[31]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[30]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[29]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[28]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[27]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[26]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[25]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[24]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[23]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[22]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[21]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[20]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[19]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[18]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[17]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[16]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[15]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[14]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[13]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[12]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[11]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[10]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[9]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[8]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[7]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[6]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[5]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[4]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[3]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[2]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[1]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_i[0]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_sel_i[3]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_sel_i[2]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_sel_i[1]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_sel_i[0]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports wb_cyc_i]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports wb_stb_i]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports wb_we_i]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_cti_i[2]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_cti_i[1]}]
set_input_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_cti_i[0]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports wb_ack_o]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[31]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[30]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[29]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[28]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[27]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[26]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[25]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[24]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[23]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[22]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[21]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[20]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[19]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[18]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[17]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[16]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[15]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[14]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[13]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[12]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[11]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[10]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[9]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[8]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[7]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[6]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[5]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[4]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[3]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[2]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[1]}]
set_output_delay -clock [get_clocks wb_clk] -add_delay -max 5.0 [get_ports {wb_dat_o[0]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_req_ack]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_busy_n]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_wr_next]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_rd_valid]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_last_rd]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[31]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[30]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[29]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[28]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[27]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[26]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[25]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[24]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[23]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[22]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[21]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[20]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[19]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[18]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[17]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[16]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[15]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[14]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[13]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[12]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[11]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[10]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[9]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[8]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[7]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[6]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[5]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[4]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[3]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[2]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[1]}]
set_input_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_rd_data[0]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_req]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[25]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[24]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[23]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[22]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[21]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[20]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[19]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[18]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[17]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[16]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[15]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[14]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[13]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[12]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[11]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[10]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[9]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[8]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[7]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[6]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[5]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[4]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[3]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[2]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[1]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_addr[0]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[8]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[7]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[6]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[5]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[4]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[3]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[2]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[1]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_req_len[0]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports sdr_req_wr_n]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_en_n[3]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_en_n[2]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_en_n[1]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_en_n[0]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[31]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[30]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[29]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[28]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[27]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[26]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[25]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[24]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[23]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[22]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[21]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[20]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[19]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[18]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[17]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[16]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[15]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[14]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[13]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[12]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[11]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[10]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[9]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[8]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[7]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[6]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[5]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[4]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[3]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[2]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[1]}]
set_output_delay -clock [get_clocks sdram_clk] -add_delay -max 10.0 [get_ports {sdr_wr_data[0]}]
set_wire_load_mode "enclosed"
